{
  "_meta": {
    "maxChars": {
      "newGame": 12,
      "continue": 12,
      "selectDevice": 22,
      "intro.1": 115,
      "intro.2": 115,
      "intro.3": 115,
      "intro.4": 115,
      "intro.5": 115,
      "intro.6": 115,
      "intro.7": 115,
      "intro.8": 115,
      "intro.9": 115,
      "intro.10": 115,
      "intro.11": 115,
      "intro.12": 115,
      "year": 8,
      "destination": 50,
      "population": 40,
      "resources": 25,
      "pollution": 25,
      "titleSavePlanet": 20,
      "textIpadMove": 60,
      "textIpadAction": 60,
      "textPCMove": 60,
      "textPCAction": 60,
      "tutorialInfo1": 115,
      "tutorialInfo0": 30,
      "tutorialInfo2": 30,
      "noObjetive": 20,
      "tutorialInfo3": 60,
      "tutorialInfo4": 60,
      "missionTutorial1" : 20,
      "missionCompleted": 20,
      "practiceCompleted": 20,
      "objectiveCompleted": 20,
      "level1Title": 30,
      "level2Title": 30,
      "level3Title": 30,
      "level1Worker": 120,
      "level1ChildDog": 120,
      "level1Objetive1": 30,
      "level1Objetive1.School": 30,
      "level1Objetive1.River": 30,
      "level1Dustman": 120,
      "level1Concierge": 120,
      "level1Principal": 120,
      "level1Principal2": 120,
      "level1Principal3": 120,
      "level1FenceWatchman": 120,
      "level1FenceWatchman2": 120,
      "level1Police": 120,
      "level1Police2": 120,
      "level1Mechanic": 120,
      "level1Mechanic2": 120,
      "populationGraph1": 140,
      "populationGraph2": 140,
      "populationGraph3": 140,
      "populationGraph4": 140,
      "populationGraph5": 140,
      "populationGraph6": 140,
      "populationGraph7": 140,
      "populationGraph8": 140,
      "populationGraph9": 140,
      "populationGraph10": 120,
      "populationGraph11": 120,
      "classTeacher": 120,
      "classTeacher1": 120,
      "classTeacher2": 120,
      "classTeacher3": 120,
      "classTeacher4": 120,
      "classTeacher5": 120,
      "classTeacher6": 120,
      "classTeacher7": 120,
      "classTeacher8": 120,
      "classTeacher9": 120,
      "classTeacher10": 120,
      "classTeacher11": 120,
      "classTeacher12": 120,
      "classTeacher13": 120,
      "classTeacher14": 120,
      "classTeacher15": 120,
      "classTeacher16": 120,
      "classTeacher17": 120,
      "classTeacher18": 120,
      "level1Completed": 120,
      "level2Title" : 120,
      "level2MissionCity" : 120,
      "citizenCity": 120,
      "factory.tour1": 120,
      "factory.tour2": 120,
      "factory.tour3":120
    }
  },
  "en": {
    "newGame": "New Game",
    "continue": "Continue",
    "selectDevice": "Select Your Device",
    "intro.1": "Year 2050, PLANET EARTH.",
    "intro.2": "In the year 2050 the human population has INCREASED to 10 billion.",
    "intro.3": "High pollution and excessive consumption of natural resources has caused the COLLAPSE.",
    "intro.4": "But there is still one last chance to SAVE THE PLANET...",
    "intro.5": "    LABORATORY on MARS",
    "intro.6": "In this laboratory a group of eminent SCIENTISTS work on something VITAL for the EARTH.",
    "intro.7": "They are designing a system that allows ELECTRONIC COMPONENTS to be sent BACK IN TIME.",
    "intro.8": "They have managed to build a ROBOT endowed with artificial intelligence.",
    "intro.9": "They want to send the ROBOT back in time, to the YEAR 2023, through a TIME MACHINE.",
    "intro.10": "With the intention of preventing the EARTH from reaching the COLLAPSE.",
    "intro.11": "Ready for LAUNCH.... 3.... 2.... 1....",
    "intro.12": "Planet EARTH - YEAR 2023",
    "year": "Year",
    "destination": "Destination Planet: EARTH       Destination Year: 2023",
    "population": "Human Population (billions)",
    "resources": "Resources",
    "pollution": "Pollution",
    "titleSavePlanet": "Save The Planet",
    "textIpadMove": "With this motion control, you can move the Robot in all directions.",
    "textIpadAction": "This is the action button. You must press it when there is an action to perform.",
    "textPCMove": "With these keys you will move the Robot in any direction.",
    "textPCAction": "Press Space to perform any allowed action.",
    "tutorialInfo1": "Poster: The water is dangerous, you must cross the river as quickly as possible.",
    "tutorialInfo0": "Important information!!!",
    "tutorialInfo2": "Solar energy will charge you",
    "noObjetive": "No Target Assigned",
    "tutorialInfo3": "Here you can see the current objective of the mission",
    "tutorialInfo4": "The arrow will indicate the direction to follow",
    "missionTutorial1" : "Exit through the TUNNEL below",
    "missionCompleted": "Mission Accomplished",
    "practiceCompleted": "Practice Completed",
    "objectiveCompleted": "Objective Completed",
    "level1Title": "Level 1: Ecological Education",
    "level2Title": "Level 2: Technological Improvements",
    "level3Title": "Level 3: Legislative Improvements",
    "level1Worker": "Worker: If you are looking for the SCHOOL, you must go down until you reach a park, there you will see the entrance.",
    "level1Objetive1": "Find the SCHOOL and ENTER",
    "level1Objetive1.School": "Find the School Director",
    "level1Objetive1.River": "Cross the river to continue with the missions",
    "level1Dustman": "Dustman: You can't pass. I'm working. If you help me PICK UP the 4 GARBAGE items from the PARK, I'll let you through.",
    "level1ChildDog": "Girl: Please, I have lost my dog. Go find it, I'm afraid of losing it. Bring it to me please.",
    "level1Concierge": "Concierge: If you are looking for the DIRECTOR of the SCHOOL, you should go in and look for him, he will be teaching SCIENCE. I open the door.",
    "level1Principal": "Principal: A Robot, how wonderful. Where do you come from? I'm amazed, it looks like a technology from the future. Let's talk.",
    "level1Principal2": "Principal: Well, we stay here observing what you do, we hope to learn with you to improve what we have studied.",
    "level1Principal3": "Principal: Come on, don't be annoying. Do it now.",
    "level1FenceWatchman": "Security Guard: I don't know why you want to come by. When you know, you come back. And remember that he can only pass accompanied by the POLICE.",
    "level1FenceWatchman2": "Security Guard: The empty plastic bottles are there. You can only go through with the police.",
    "level1Police": "Police: What do you want? when you know, you come back.",
    "level1Police2": "Police: Okay. I accompany you. I follow you.",
    "level1Mechanic": "Mechanic: The boat is broken. You can't get on. Although if you bring me 5 PLASTIC BOTTLES, I can repair it.",
    "level1Mechanic2": "Mechanic: Search the work below, past the guard, you might find them.",
    "populationGraph1": "As you said, I am a Robot. I come from the FUTURE. What I have to tell you is vitally important.",
    "populationGraph2": "In this device I will show you the evolution of the human population, the consumption of resources and the consequent pollution.",
    "populationGraph3": "Here you can see the year of beginning of the graph. From the year 1850, to the year 2050.",
    "populationGraph4": "And here the population of planet Earth in billions of people.",
    "populationGraph5": "In this sidebar the contamination at a global level in each year. Air pollution, sea, etc...",
    "populationGraph6": "And in this bar the consumption of natural resources in each year. Food, fuel, water, etc...",
    "populationGraph7": "With this button you will increase years in the graph.",
    "populationGraph8": "And with this button you can go back years in the graph.",
    "populationGraph9": "When you have reviewed the graph with your students. You can exit by pressing this button.",
    "populationGraph10": "With the different missions, you must ensure that the contamination does not exceed the maximum allowed.",
    "populationGraph11": "With the different missions, you must ensure that the consumption of resources does not exceed the maximum allowed.",
    "classTeacher": "The Robot is right, it is necessary to avoid excessive consumption of resources and reduce pollution.",
    "classTeacher1": "I am going to teach you how to apply the 3 R's. \n- Reduce \n- Reuse \n- Recycle.",
    "classTeacher2": "Reduce: The first step to a more sustainable world is to minimize the amount of resources we consume in our day to day.",
    "classTeacher3": "Actions that can be taken: \n- Use energy saving light bulbs or LEDs instead of traditional ones.",
    "classTeacher4": "- Avoid using plastic bags and always carry reusable shopping bags with you.",
    "classTeacher5": "- Reduce water use: turn off the tap while brushing your teeth, fill the washing machine completely before using it, etc...",
    "classTeacher6": "- Save energy by turning off lights and electronic devices that you are not using.",
    "classTeacher7": "Reuse: Before you throw something away, think about whether you can give it a second use.",
    "classTeacher8": "Actions that can be taken: \n- Reuse water bottles and avoid single-use ones.",
    "classTeacher9": "- Donate clothes and toys that you no longer use.",
    "classTeacher10": "- Create crafts with recycled materials, such as cans or cardboard boxes.",
    "classTeacher11": "- Use glass food storage containers instead of single-use plastic containers.",
    "classTeacher12": "Recycle: When we cannot avoid generating waste, it is important to ensure that it is recycled correctly.",
    "classTeacher13": "Actions that can be taken: \n- Learn to separate waste: organic, inorganic, paper, plastic, glass, etc...",
    "classTeacher14": "- Use recycling bins at school and at home.",
    "classTeacher15": "- Participate in special waste collection programs such as batteries, used cooking oil, old electronic devices, etc...",
    "classTeacher16": "- Promote recycling in your community.",
    "classTeacher17": "Good!!! Let's put it into practice. Robot, give us a demo!",
    "classTeacher18": "Come on!!!",
    "level1Completed": "Enter the industrial zone of the city.",
    "level2Title" : "Level 2 - Technological Improvements",
    "level2MissionCity" : "Go to the industrial factories",
    "citizenCity": "Citizen: If you are looking for the factory, it is at the end of the street on the left. It's all very dirty, be careful.",
    "factory.tour1": "1",
    "factory.tour2": "2",
    "factory.tour3": "3"
  },
  "es": {
    "newGame": "Nuevo Juego",
    "continue": "Continuar",
    "selectDevice": "Selecciona Tu Dispositivo",
    "intro.1": "Año 2050, PLANETA TIERRA.",
    "intro.2": "En el año 2050 la población humana ha AUMENTADO hasta los diezmil millones.",
    "intro.3": "La alta contaminación y el excesivo consumo de recursos naturales, ha provocado el COLAPSO.",
    "intro.4": "Pero aún hay una última oportunidad para SALVAR AL PLANETA...",
    "intro.5": "    LABORATÓRIO en MARTE",
    "intro.6": "En este laboratorio un grupo de CIENTÍFICOS trabajan en algo VITAL para la TIERRA.",
    "intro.7": "Están diseñando un sistema que permite enviar al PASADO COMPONENTES ELECTRÓNICOS.",
    "intro.8": "Han logrado construir un ROBOT dotado con inteligencia artificial.",
    "intro.9": "Quieren enviar al ROBOT al pasado, al año 2023, a través de una MÁQUINA DEL TIEMPO.",
    "intro.10": "Con la intención de evitar que la TIERRA llegue al COLAPSO.",
    "intro.11": "Listos para el LANZAMIENTO.... 3.... 2.... 1....",
    "intro.12": "Planeta TIERRA - AÑO 2023",
    "year": "Año",
    "destination": "Destino: Planeta TIERRA       Año Destino: 2023",
    "population": "Población Humana (billions)",
    "resources": "Recursos",
    "pollution": "Contaminación",
    "titleSavePlanet": "Salva el Planeta",
    "textIpadMove": "Con este control de movimiento, puedes mover al Robot en todas direcciones.",
    "textIpadAction": "Este es el botón de acción. Debes pulsarlo cuando haya alguna acción que realizar.",
    "textPCMove": "Con estas teclas moverás al Robot en cualquier dirección. ",
    "textPCAction": "Pulsa Espacio para realizar cualquier acción permitida.",
    "tutorialInfo1": "Cartel: El agua es peligrosa, debes cruzar el rio lo más rapidamente posible.",
    "tutorialInfo0": "Información importante!!!",
    "tutorialInfo2": "La Energia SOLAR te carga",
    "noObjetive": "Sin Objetivo Asignado",
    "tutorialInfo3": "Aquí puedes ver el objetivo actual de la misión",
    "tutorialInfo4": "La flecha te indicará la dirección a seguir",
    "missionTutorial1" : "Salir por el TUNEL de abajo",
    "missionCompleted": "Misión Cumplida",
    "practiceCompleted": "Práctica Completada",
    "objectiveCompleted": "Objetivo Completado",
    "level1Title": "Nivel 1: Educación Ecológica",
    "level2Title": "Nivel 2: Mejoras Tecnológicas",
    "level3Title": "Nivel 3: Mejoras Legislativas",
    "level1Worker": "Obrero: Si buscas el COLEGIO, debes bajar hasta llegar a un parque, ahí verás la entrada.",
    "level1Objetive1": "Encontrar el COLEGIO y ENTRAR",
    "level1Objetive1.School": "Encontrar al Director de la Escuela",
    "level1Objetive1.River": "Cruzar el río para continuar con las misiones",
    "level1Dustman": "Basurero: No se puede pasar. Estoy trabajando. Si me ayudas a RECOGER los 4 objetos de BASURA del PARQUE, te dejo pasar.",
    "level1ChildDog": "Niña: Por favor, he perdido a mi perro. Ve a buscarlo, tengo miedo de perderlo. Traemelo por favor.",
    "level1Concierge": "Conserje: Si buscas al DIRECTOR de la ESCUELA, debes entrar y buscarlo, estará enseñando CIENCIAS. Te abro la puerta.",
    "level1Principal": "Director: Un Robot, qué maravilla, ¿de dónde vienes? Estoy asombrado, parece de una tecnología del futuro. Hablemos.",
    "level1Principal2": "Director: Bien, nos quedamos aquí observando lo que haces, esperamos aprender contigo para mejorar en lo que hemos estudiado.",
    "level1Principal3": "Director: Venga, no seas pesado. Hazlo ya...",
    "level1FenceWatchman": "Vigilante: No se para qué quieres pasar. Cuando lo sepas, vuelves. Y recuerda que solo puede pasar acompañado con la POLICÍA.",
    "level1FenceWatchman2": "Vigilante: Las botellas de plastico vacías están ahí. Solo puedes pasar con la policía.",
    "level1Police": "Policía: ¿Qué quieres? cuando lo sepas, vuelves.",
    "level1Police2": "Policía: Vale. Te acompaño. Te sigo.",
    "level1Mechanic": "Mecánico: La barca está rota. No te puedes subir. Aunque si me traes 5 BOTELLAS DE PLÁSTICO, puedo repararla.",
    "level1Mechanic2": "Mecánico: Busca en la obra de más abajo, pasado el vigilante, quizá las encuentres.",
    "populationGraph1": "Como bien has dicho soy un Robot. Vengo del FUTURO. Lo que tengo que decirles es de vital importancia.",
    "populationGraph2": "En este dispositivo le mostraré la evolución de la población humana, el consumo de recursos y la contaminación consecuente.",
    "populationGraph3": "Aquí pueden ver el año de comienzo de la gráfica. Desde el año 1850, hasta el año 2050.",
    "populationGraph4": "Y aquí la población del planeta Tierra en billones de personas.",
    "populationGraph5": "En esta barra lateral la contaminación a nivel global en cada año. Contaminación del aire, mar, etc...",
    "populationGraph6": "Y en esta barra el consumo de recursos naturales en cada año. Alimentos, combustibles, agua, etc...",
    "populationGraph7": "Con este botón aumentarás los años en la gráfica.",
    "populationGraph8": "Y con este botón podrás retroceder años en la gráfica.",
    "populationGraph9": "Cuando haya revisado la gráfica con sus alumnos. Puede salir pulsando este botón.",
    "populationGraph10": "Con las diferentes misiones, debes asegurarte de que la contaminación no supere el máximo permitido.",
    "populationGraph11": "Con las distintas misiones, debes lograr que el consumo de recursos no superen el máximo permitido.",
    "classTeacher": "El Robot tiene razón, hay evitar el consumo excesivo de recursos y disminuir la contaminación.",
    "classTeacher1": "Te voy a enseñar a aplicar las 3 R's. \n- Reducir \n- Reutilizar \n- Reciclar.",
    "classTeacher2": "Reducir: El primer paso para un mundo más sostenible es minimizar la cantidad de recursos que consumimos en nuestro día a día.",
    "classTeacher3": "Acciones que se pueden tomar: \n- Utiliza bombillas de bajo consumo o LEDs en lugar de las tradicionales.",
    "classTeacher4": "- Evita usar bolsas de plástico y lleva siempre contigo bolsas reutilizables para las compras.",
    "classTeacher5": "- Reduce el uso de agua: cierra el grifo mientras te cepillas los dientes, llena completamente la lavadora antes de usarla, etc...",
    "classTeacher6": "- Ahorra energía apagando luces y aparatos electrónicos que no estés utilizando.",
    "classTeacher7": "Reutilizar: Antes de tirar algo, piensa si puedes darle un segundo uso.",
    "classTeacher8": "Acciones que se pueden tomar: \n- Reutiliza botellas de agua y evita las de un solo uso.",
    "classTeacher9": "- Dona ropa y juguetes que ya no uses.",
    "classTeacher10": "- Crea manualidades con materiales reciclados, como latas de conservas o cajas de cartón.",
    "classTeacher11": "- Utiliza envases de vidrio para guardar alimentos en lugar de recipientes de plástico de un solo uso.",
    "classTeacher12": "Reciclar: Cuando no podemos evitar generar residuos, es importante asegurarnos de que se reciclen correctamente.",
    "classTeacher13": "Acciones que se pueden tomar: \n- Aprende a separar los residuos: orgánicos, inorgánicos, papel, plástico, vidrio, etc...",
    "classTeacher14": "- Utiliza papeleras de reciclaje en la escuela y en casa.",
    "classTeacher15": "- Participa en programas de recolección de residuos especiales como pilas, aceite de cocina usado, aparatos electrónicos viejos, etc...",
    "classTeacher16": "- Promueve el reciclaje en tu comunidad.",
    "classTeacher17": "Bien!!! Vamos a ponerlo en práctica. Robot, haznos una demostración!",
    "classTeacher18": "Vamos!!!",
    "level1Completed": "Entra en la zona industrial de la ciudad.",
    "level2Title" : "Nivel 2 - Mejoras Tecnológicas",
    "level2MissionCity" : "Ve hacia las fabricas industriales",
    "citizenCity": "Ciudadana: Si buscas la fabrica, está al final de la calle a la izquierda. Está todo muy sucio, ten cuidado.",
    "factory.tour1": "1",
    "factory.tour2": "2",
    "factory.tour3": "3"
  }
}